<section class="company__info">
    <h1 id="heading1" class="section__title animated">
    <span class="section__title_allocation">
        С ... года 
    </span> 
    разрабатываем<br> 
    инновационные решения
    </h1>
    <p class="section__subtext animated">
    Наша компания проводит комплекс мероприятий, направленных на
    обеспечение бесперебойной подачи электроэнергии на объекты
    промышленного, коммерческого и гражданского значения. От качества
    монтажа электрооборудования зависит надежная работа источников питания
    и безопасность людей. Поэтому необходимо со всей ответственностью
    отнестись к выбору подрядчика с большим опытом проведения
    электромонтажных работ.
    </p>
</section>