<script>
      import Possibility from "./Possibility.svelte";
        import light                                                     from "$lib/img/possibilities/light.jpg";
  import climat                                                    from "$lib/img/possibilities/climat.jpg";
  import security                                                  from "$lib/img/possibilities/security.jpg";
  import devices                                                   from "$lib/img/possibilities/devices.jpg";
  import multimedia                                                from "$lib/img/possibilities/multimedia.jpg";
  import smarthouse                                                from "$lib/img/possibilities/smarthouse.jpg";

    let categoriesName = "Освещение";

    const listLighting = ["Умное освещение открывает перед нами широкие возможности для создания комфортной и уютной атмосферы в доме. Благодаря регулированию яркости и цветовой гаммы, мы можем легко подстраивать освещение под наше настроение и потребности. Управление через приложение делает процесс контроля освещением удобным и эффективным, а возможность настройки автоматизированных сценариев позволяет создать умную систему освещения, которая работает для нас. Интеграция с другими умными устройствами позволяет создать единое умное пространство в доме, где каждый элемент взаимодействует друг с другом, делая нашу жизнь более удобной и эффективной.", "💡 Регулирование яркости", "🌈 Цветовая гамма", "📱 Автоматизация", "🌐 Интеграция с другими умными устройствами"];

  const listClimateControl = ["Умный дом предлагает широкий спектр возможностей для контроля климата, обеспечивая комфорт, энергоэффективность и удобство для его обитателей. С помощью систем умного климат-контроля можно регулировать температуру, влажность, вентиляцию и даже качество воздуха в помещениях с помощью программирования расписания работы или дистанционного управления через мобильное приложение. Автоматизированные сценарии позволяют оптимизировать использование отопления, кондиционирования и вентиляции в соответствии с привычками и расписанием жильцов, что не только обеспечивает комфортную обстановку, но также помогает экономить энергию и снижать расходы на коммунальные услуги.", "🌡️ Регулирование температуры", "💧 Контроль влажности", "💨 Управление вентиляцией", "💰 Энергоэффективность", "⚙️ Интеграция с другими системами"];

  const listSecurity = ["Безопасность в умном доме обеспечивается разнообразными технологиями и функциями, которые помогают защитить как физическую, так и кибербезопасность жильцов. Системы видеонаблюдения, датчики движения и дверные замки могут предотвратить несанкционированный доступ и зафиксировать незаконные действия в реальном времени. Умные датчики дыма и утечек газа обеспечивают оперативное оповещение и предотвращение чрезвычайных ситуаций. Технологии распознавания лиц и голосовых команд позволяют автоматизировать доступ к дому и управление устройствами, идентифицируя жильцов. Кроме того, современные системы умного дома предлагают защиту кибербезопасности, включая шифрование данных, защиту Wi-Fi сети, многофакторную аутентификацию и мониторинг сетевой активности для выявления потенциальных угроз. Все эти возможности создают надежный и защищенный умный дом, обеспечивая жильцам спокойствие и уверенность в их безопасности.", "🎥 Видеонаблюдение", "🚪 Умные замки", "🔥 Датчики дыма и утечек", "👤 Распознавание лиц и голосовые команды", "🔐 Кибербезопасность"];

  const listDevices = ["Умный дом предлагает широкие возможности подключения различных устройств для создания умной и автоматизированной инфраструктуры. От осветительных систем и систем отопления/охлаждения до умных устройств безопасности и бытовой техники - все эти устройства могут быть интегрированы в общую сеть умного дома. Пользователи могут управлять этими устройствами через централизованный контроллер, мобильное приложение или голосовые команды, создавать сценарии автоматизации в зависимости от своих потребностей и предпочтений. Благодаря стандартам связи, таким как Wi-Fi, Zigbee, Z-Wave и Bluetooth, устройства могут легко коммуницировать между собой, что позволяет создавать умные системы управления, повышать комфорт и энергоэффективность жилья, а также делать жизнь более удобной и безопасной для его обитателей.", "📶 Широкий выбор устройств", "🤖 Интеграция и совместимость", "📱 Удобное управление", "💡 Автоматизация и сценарии", "🔒 Безопасность и конфиденциальность", "🌿 Энергоэффективность"];

  const listMultimedia = ["Умный дом предлагает разнообразные возможности в области мультимедии, обогащая жизнь обитателей разнообразными развлекательными и информационными опциями. Современные системы умного дома позволяют создавать домашние кинотеатры с высоким разрешением видео и качественным звуком, управляемые голосом или с помощью мобильного приложения. Пользователи могут настраивать световые сцены для создания оптимальной атмосферы просмотра и автоматически опускать шторы во время воспроизведения фильма. Умные аудиосистемы позволяют стримить музыку в разных зонах дома одновременно или независимо друг от друга, создавая персонализированные музыкальные атмосферы в разных помещениях. Благодаря интеграции с голосовыми ассистентами, пользователи могут запускать медиаконтент, управлять громкостью и получать информацию, не прикасаясь к устройствам. В целом, возможности мультимедии умного дома позволяют жильцам наслаждаться удивительным звуком и видео в уютной обстановке своего дома, делая досуг более удобным и приятным.", "🎬 Домашний кинотеатр", "🎶 Мультирум аудиосистемы", "💡 Настройка световых сцен", "🚪 Автоматизированный контроль штор", "🌐 Интеграция с онлайн-сервисами"];
  
  const listSmarthouse = ["Беспроводные технологии играют ключевую роль в современных умных домах, обеспечивая гибкость, удобство и расширяемость системы. Благодаря Wi-Fi, Bluetooth, Zigbee, Z-Wave и другим стандартам связи, устройства в умном доме могут быть легко подключены к центральному контроллеру или маршрутизатору без необходимости прокладывать провода, что делает установку и настройку легкой и удобной. Пользователи могут добавлять новые устройства в систему без лишних трудностей, расширяя функциональность и умные возможности дома по мере необходимости. Беспроводные технологии также обеспечивают возможность управления умным домом из любой точки мира через интернет, что позволяет мониторить и контролировать систему удаленно через мобильные устройства. Все это делает беспроводные умные дома привлекательным выбором для тех, кто ценит современные технологии, удобство использования и гибкость в настройке своего домашнего окружения.", "📶 Гибкость в размещении", "💻 Легкость добавления новых устройств", "💬 Удаленное управление", "🔧 Простота обслуживания", "📡 Широкий выбор устройств"];

    let possiableTargets = [];


    function OpenBenefistsList(event) {
    if (possiableTargets.length > 0) {
      possiableTargets[0].style.backgroundColor = "var(--body-background-color)";
      possiableTargets[0].style.color = "var(--text-color)";
      possiableTargets.pop();
      console.log(possiableTargets);
    }

    const target = event.target;
    const targetContent = target.textContent; 
    console.log(targetContent);
    const possibCatItem = document.querySelector(".possibilities__categories_item")
    possibCatItem.style.backgroundColor = "var(--body-background-color)";

    switch (targetContent) {
      case "Освещение":
        categoriesName = "Освещение";
        target.style.backgroundColor = "var(--secondary-color)";
        possiableTargets.push(target);
        break;
      case "Климат контроль":
        categoriesName = "Климат контроль";

        target.style.backgroundColor = "var(--secondary-color)";
        possiableTargets.push(target);
        break;
      case "Безопасность":
        categoriesName = "Безопасность";

        target.style.backgroundColor = "var(--secondary-color)";
        possiableTargets.push(target);
        break;
      case "Устройства":
        categoriesName = "Устройства";

        target.style.backgroundColor = "var(--secondary-color)";
        possiableTargets.push(target);
        break;
      case "Мультимедиа":
        categoriesName = "Мультимедиа";

        target.style.backgroundColor = "var(--secondary-color)";
        possiableTargets.push(target);
        break;
      case "Беспроводной умный дом":
        categoriesName = "Беспроводной умный дом";

        target.style.backgroundColor = "var(--secondary-color)";
        possiableTargets.push(target);
        break;
      default:
        console.error("Такой возможности не существует");
    }
  }
</script>

<section class="possibilities animated">
    <div class="possibilities__categories animated" on:click={OpenBenefistsList}>
    <div class="possibilities__categories_item animated">Освещение</div>
    <div class="possibilities__categories_item animated">Климат контроль</div>
    <div class="possibilities__categories_item animated">Безопасность</div>
    <div class="possibilities__categories_item animated">Устройства</div>
    <div class="possibilities__categories_item animated">Мультимедиа</div>
    <div class="possibilities__categories_item animated">Беспроводной <br/>умный дом</div>
    </div>

    {#if categoriesName === "Освещение"}
    <Possibility listBenefists = {listLighting} img = {light}/>
    {:else if categoriesName === "Климат контроль"}
    <Possibility listBenefists = {listClimateControl} img = {climat} />
    {:else if categoriesName === "Безопасность"}
    <Possibility listBenefists = {listSecurity} img = {security}/>
    {:else if categoriesName === "Устройства"}
    <Possibility listBenefists = {listDevices} img = {devices}/>
    {:else if categoriesName === "Мультимедиа"}
    <Possibility listBenefists = {listMultimedia} img = {multimedia}/>
    {:else if categoriesName === "Беспроводной умный дом"}
    <Possibility listBenefists = {listSmarthouse} img = {smarthouse}/>
    {/if}
</section>